[
    ["Why didn't the bike go to the party?",
    "Because it was two tired!"],
    ["Why didn't the sun go to university?",
    "Because it already has millions of degrees!"],
    ["Why don't all the other bears hang out with koala bears?",
    "Because they don't meet the koala-fications!"],
    ["What is an owl's favourite subject?",
    "Owl-gebra!"],
    ["What do you call a fake noodle?",
    "An impasta!"],
    ["Did you hear about the restaurant on the moon?",
    "Great food, no atmosphere!"],
    ["Want to hear a joke about paper?",
    "Never mind - it's tearible!"],
    ["Want to hear a joke about pizza?",
    "Never mind - it's too cheesy!"],
    ["What did one hat say to the other hat?",
    "You stay here, I'll go on a-head!"],
    ["What did the fish say when it swam into a wall?",
    "Dam!"],
    ["Why did the golfer change his pants?",
    "Because he got a hole in one!"],
    ["Why did the cyclops close their school?",
    "Because they only had one pupil!"],
    ["Why did the scarecrow get promoted?",
    "Because he was outstanding in his field!"],
    ["Why can't a nose be twelve inches long?",
    "Because then it'd be a foot!"],
    ["Why can't two elephants go swimming together?",
    "Because they only have one pair of trunks!"],
    ["Did you hear about the mathematician who's afraid of negative numbers?",
    "He'll stop at nothing to avoid them!"],
    ["Why do we tell actors to 'break a leg'?",
    "Because every play has a cast!"],
    ["Did you hear about the claustraphobic astronaut?",
    "She just needed a little space."],
    ["Why don't scientists trust atoms?",
    "Because they make up everything!"],
    ["What sits at the bottom of the sea and twitches?",
    "A nervous wreck!"],
    ["Someone says \"Doc, help me! I'm addicted to Twitter!\" to their doctor.",
    "Their doctor replies \"Sorry, I don't follow you...\""],
    ["What do you call a parade of rabbits hopping backwards?",
    "A receding hare-line!"],
    ["Why should the number 288 never be mentioned?",
    "It's two gross!"],
    ["What did the left eye say to the right eye?",
    "Between you and me, something smells."],
    ["What do you call a pony with a cough?",
    "A little hoarse!"],
    ["What's orange and sounds like a parrot?",
    "A carrot!"],
    ["When is a car not a car?",
    "When it turns into a driveway!"],
    ["When is a door not a door?",
    "When it's a-jar!"],
    ["What did the shark say when it ate the clowfish?",
    "This tastes a little funny..."],
    ["What did the pirate say when he turned 80?",
    "Aye-matey"],
    ["How do astronauts order food online?",
    "They use the space bar!"],
    ["What do you call an apology written in dots and dashes?",
    "Re-morse code!"],
    ["One time my dog ate all my scrabble tiles.",
    "He kept leaving little messages around the house!"],
    ["Did you hear about the two people who stole a calender?",
    "They each got six months."],
    ["What do you get from a pampered cow?",
    "Spoiled milk!"],
    ["Why did the oreo go to the dentist?",
    "Because it lost its filling!"],
    ["What breed of dog can jump higher than a building?",
    "All of them. Buildings can't jump!"],
    ["Why is it annoying to be around basketball players?",
    "They dribble all the time!"],
    ["How many times can you subtract 10 from 100?",
    "Once. The next time you'd be subtracting 10 from 90!"],
    ["Why did the M&M go to school?",
    "It wanted to be a Smartie!"],
    ["Why do bees have sticky hair?",
    "Because they use honey-combs!"],
    ["I poured root beer in a square glass.",
    "Now I just have beer!"],
    ["How do you throw a space party?",
    "You plan-it!"],
    ["Why did it get so hot in the stadium after the game?",
    "All of the fans left!"],
    ["What do you call a train carrying bubblegum?",
    "A chew-chew train!"],
    ["Why did the math textbook visit the guidance counselor?",
    "It needed help figuring out its problems!"],
    ["Why can't male ants sink?",
    "Because they're buoy-ant!"],
    ["What's the best thing about Switzerland?",
    "I don't know, but the flag is a big plus!"],
    ["Did you hear about the actor who fell through the floorboards?",
    "She was just going through a stage."],
    ["What did the buffalo say when her son left for university?",
    "Bi-son."],
    ["Someone says to their friend \"What rhymes with orange?\"",
    "Their friend replies \"No it doesn't!\""],
    ["My dog used to chase people on a bike.",
    "It got so bad I had to take his bike away!"],
    ["Helium walks into a bar.",
    "The bartender says \"Sorry, we don't serve nobles here.\" He doesn't react."],
    ["You don't need a parachute to go skydiving.",
    "You need a parachute to go skydiving twice!"],
    ["Parallel lines have so much in common.",
    "It's a shame they'll never meet."],
    ["Someone stole my mood ring.",
    "I don't know how I feel about that."],
    ["I broke my finger last week.",
    "On the other hand, I'm okay!"],
    ["Why do cows wear bells?",
    "Because their horns don't work?"],
    ["I heard oxygen and magnesium were going out.",
    "And I was like OMg!"],
    ["My teacher threw sodium chloride at me.",
    "That's a-salt!"],
    ["Old chemists never die.",
    "They just stop reacting!"],
    ["What did one charged atom say to the other?",
    "I've got my i-on you."],
    ["What did the chemist say when he found two isotopes of helium?",
    "HeHe!"],
    ["Oxygen, hydrogen, sulfur, sodium, and phosphorus walk into a bar.",
    "The bartender says \"OH SNaP!\""],
    ["Two chemists walk into a bar. One of them says \"I'll have an H2O.\" The other one says \"I'll have an H2O too.\"",
    "The second chemist dies."],
    ["I heard oxygen went on a date with potassium.",
    "It went OK."],
    ["The optimist sees the glass half full, the pessimist sees the glass half empty",
    "The chemist sees the glass as full!"],
    ["Why are chemists great at solving problems?",
    "Because they always have a solution!"],
    ["Gold walks into a bar.",
    "The bartender says \"A-u, get out of here!"],
    ["I'd tell some chemistry jokes.",
    "But all the good ones ar-gon!"],
    ["Want to hear a joke about nitrogen oxide?",
    "NO!"],
    ["What's the first thing a chemistry teacher teaches?",
    "Ammonia. It's pretty basic stuff."],
    ["Why didn't the bike go for a walk?",
    "Bikes don't walk."],
    ["Why are elevator jokes so good?",
    "They work on so many levels!"],
    ["How do celebrities stay cool?",
    "They have many fans!"],
    ["Which is faster, hot or cold?",
    "Hot. You can catch a cold!"],
    ["Why can't a leopard hide?",
    "Because he's always spotted!"],
    ["Why are spiders so smart?",
    "Because they can find everything on the web!"],
    ["I like telling Dad jokes.",
    "Sometimes he laughs."],
    ["What do sprinters eat before a race?",
    "Nothing. They fast."],
    ["What's the difference between a poorly dressed man on a tricycle and a well-dressed man on a bicycle?",
    "A-tire!"],
    ["Did you hear the rumour about butter?",
    "Well, I'm not going to spread it."],
    ["Why did the old man fall in the well?",
    "He couldn't see that well!"],
    ["What do you call a factory that sells passable products?",
    "A satisfactory!"],
    ["Want to hear a joke about construction?",
    "Sorry, I'm still working on it."],
    ["My boss told me to have a good day.",
    "So I went home!"],
    ["I'm really good at sleeping.",
    "I can do it with my eyes closed!"],
    ["I thought about going on an all almond diet.",
    "But that's just nuts!"],
    ["Two goldfish are in a tank.",
    "One says to the other \"How do you drive this thing?!\""],
    ["The difference between a numerator and a denominator is a short line.",
    "Only a fraction of people understand this!"],
    ["Can February march?",
    "No, but April May!"],
    ["After dinner, my wife asked me to clear the table.",
    "I needed a running start, but I made it!"],
    ["I know a lot of jokes about retired people.",
    "None of them work!"],
    ["Why do trees seem suspicious on sunny days?",
    "They just seem a little shady."],
    ["I've been bored recently so I decided to take up fencing.",
    "The heighbours have threatened to call the police unless I put it all back!"],
    ["Today my son asked me for a book-mark.",
    "I burst into tears. After 11 years he still doesn't know my name!"],
    ["How do you make holy water?",
    "You boil the hell out of it!"],
    ["Did you know the first French Fries weren't made in France?",
    "They were made in Greece!"],
    ["I'm reading a book about anti-gravity.",
    "It's impossible to put down!"],
    ["What do you call someone with no body and no nose?",
    "Nobody Knows!"],
    ["What's the least spoken language in the world?",
    "Sign language!"],
    ["Someone says \"How do I look?\"",
    "Their friend replies \"With your eyes!\""],
    ["What do you call a deer with no eyes?",
    "No idea!"],
    ["I used to have a job at a calender factory.",
    "I got fired cause I took a couple of days off."],
    ["I bought some velcro yesterday.",
    "It was a total rip-off!"],
    ["Did you hear about the circus fire?",
    "It was in-tents!"],
    ["I'm only familiar with 25 letters in the English language.",
    "I don't know why!"],
    ["What do you get when you cross a snowman with a vampire?",
    "Frostbite!"],
    ["As a lumberjack, I know that I've cut down 2241 trees.",
    "I know because every time I cut one down I keep a log!"],
    ["What happens if you rearrange the letters of 'postmen'?",
    "They get really pissed off!"],
    ["Have you heard of the band called 23MB?",
    "They're good, but they haven't got a gig yet!"],
    ["I heard they made round bays of hay illegal.",
    "It's because the cows weren't getting a square meal."],
    ["What's a pirate's favourite letter of the alphabet?",
    "You'd think it would be R, but it's the C's they love."],
    ["Why can't a pirate learn the alphabet?",
    "They always get stuck at C!"],
    ["What are the three unwritten rules of life?",
    "1.\n2.\n3."],
    ["Why should you never eat a clock?",
    "Because it's time consuming!"],
    ["What do you call a blind dinosaur?",
    "A do-you-think-he-saw-us!"],
    ["I'm afraid for the calendar.",
    "It's days are numbered!"],
    ["My wife said I should do lunges to stay in shape.",
    "That would be a big step forward!"],
    ["What do you call a fish wearing a bowtie?",
    "Sofishticated!"],
    ["Did you hear about the chocolate record player?",
    "It sounds pretty sweet."],
    ["I asked my dog what two minus two was.",
    "He said nothing."],
    ["Someone says to their friend \"Did you get a haircut?\"",
    "Their friend replies \"No I got them all cut!\""],
    ["Why don't eggs tell jokes?",
    "They'd crack each other up!"],
    ["A child says \"Dad can you put my shoes on?\"",
    "Their dad replies \"No I don't think they'll fir me.\""],
    ["How do you make 7 even?",
    "Take away the s!"],
    ["What do you call it when a snowman throws a tantrum?",
    "A meltdown!"],
    ["Someone told me a joke about boxing once.",
    "I guess I missed the punch line."],
    ["What country's capital is growing the fastest?",
    "Ireland. Everyday it's Doublin!"],
    ["Did you hear about the kid-napping at school?",
    "He woke up."],
    ["A cheeseburger walks into a bar.",
    "The bartender says \"Sorry we don't serve food here.\""],
    ["I'm on a seafood diet.",
    "I see food and I eat it!"],
    ["I used to play piano by ear.",
    "Now I use my hands!"],
    ["I made a pencil with two erasers.",
    "It was pointless!"],
    ["Did you hear about the guy who invented the 'knock-knock' joke?",
    "He won the no-bell prize!"],
    ["What is a Linux user's favourite game?",
    "sudo ku"],
    ["Why do astronauts use Linux?",
    "Because you can't open windows in space!"],
    ["Why do vampires use Linux?",
    "Because they don't like windows in their house!"],
    ["Why are people from Norway so good at editing files in Linux?",
    "Their ancestors are vi-kings!"],
    ["I used to install windows.",
    "It was a real pane"],
    ["What are clouds made of?",
    "Linux servers mostly."],
    ["I'm horrified to admit I don't have any corny jokes today.",
    "If you have one though, I'm all ears :)"],
    ["I just texted my dad after finding a spider web in my laptop.",
    "\"Good - your laptop is bug free.\""],
    ["To whoever stole my copy of Microsoft Office, I will find you.",
    "You have my Word."],
    ["What is the similarity between toll booths and Microsoft?",
    "They're both basically Bill Gates!"],
    ["The new Windows update deleted Microsoft Edge.",
    "We could say it's cutting edge technology."],
    ["What's the opposite of Microsoft Office?",
    "Macrohard Onfire!"]
]
